In [1]:
import sqlite3

In [15]:
import pandas as pd

In [2]:
query = """CREATE TABLE test(a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER)"""

In [3]:
con = sqlite3.connect('mydata.sqlite')

In [4]:
con.execute(query)

In [5]:
con.commit()

In [6]:
data = [('Atlana', 'Georgia', 1.25, 6),
       ('Tallahassee', 'Florida', 2.6, 3),
       ('Sacramento', 'California', 1.7, 5)]

In [7]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [8]:
con.executemany(stmt, data)

In [9]:
con.commit()

In [10]:
cursor = con.execute('select * from test')

In [11]:
rows = cursor.fetchall()

In [12]:
rows

[('Atlana', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [14]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [18]:
frame = pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

In [19]:
frame

             a           b     c  d
0       Atlana     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [20]:
frame.a

0         Atlana
1    Tallahassee
2     Sacramento
Name: a, dtype: object

In [21]:
frame.a[0]

'Atlana'

In [23]:
query = """CREATE TABLE userinfo(a VARCHAR(20), b INTEGER)"""

In [24]:
con = sqlite3.connect('mydata.sqlite')

In [25]:
con.execute(query)

In [26]:
con.commit()

In [27]:
data = [('Alex', 50),
        ('John', 45),
        ('Tyler', 28)]

In [28]:
stmt = "INSERT INTO userinfo VALUES(?, ?)"

In [29]:
con.executemany(stmt, data)

In [30]:
con.commit()

In [31]:
cursor = con.execute('select * from userinfo')

In [32]:
rows = cursor.fetchall()

In [33]:
rows

[('Alex', 50), ('John', 45), ('Tyler', 28)]

In [34]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None))

In [39]:
frame1 = pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

In [40]:
frame1

       a   b
0   Alex  50
1   John  45
2  Tyler  28

In [41]:
frame1.b

0    50
1    45
2    28
Name: b, dtype: int64

In [42]:
frame1.b[1]

45

In [ ]:
frame1